Autodesk.Revit.DB.DWFImportOptions.GetSheetViews
Get sheet views where DWF markups are imported.
Returns:
An array of sheet views
Since:
2014

Autodesk.Revit.DB.DWFImportOptions.SetSheetViews(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Set sheet views where DWF markups are imported.
sheetViews:
An array of imported sheet views.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DWFImportOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.DWFImportOptions.#ctor(Autodesk.Revit.DB.DWFImportOptions)
Constructs a new instance of DWFImportOptions as a copy of the import options.
option:
The options to be copied.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DWFImportOptions.#ctor(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Constructs a new instance of DWFImportOptions with an array of imported sheet views.
views:
These sheet views where DWF markups are imported.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DWFImportOptions
The import options used by importing DWF or DWFx format file.
Since:
2014